driver-tests/bpelse/misc/MiscJbi/test/Crm1wayWhileOutonly/Input.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" 
        xmlns:xsd="http://www.w3.org/1999/XMLSchema"
        xmlns:tns="http://seebeyond.com/Crm1wayWhileOutonly/" 
        xmlns:wscustrm="http://schemas.stc.com/ws/2005/07/custrm"
        xmlns="urn:Crm1wayWhileOutonly">
    <SOAP-ENV:Header>
        <wscustrm:MessageID>Crm1wayWhileOutonlyClientID-1</wscustrm:MessageID>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body> 
        <helloObj>
            <string>b1</string>
            <nonNegativeInteger>100</nonNegativeInteger>
            <byte>a</byte>
            <short>5</short>
            <int>12345</int>
            <long>12345</long>
            <negativeInteger>-100</negativeInteger>
            <dateTime>10/10/2000</dateTime>
            <nonPositiveInteger>0</nonPositiveInteger>
            <duration>P0Y0M0DT0H0M10S</duration>
            <ENTITIES>string byte short</ENTITIES>
            <double>1.111</double>
            <ENTITY>byte</ENTITY>
            <float>1.11</float>
         </helloObj>
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope> 